[
  {
    "type": "games",
    "url": "2024-04-26-free-play-days-railway-empire-prison-architect-and-tramsim-console-edition",
    "link": "8yShmqKG",
    "writer": "Kyle Ocean, Business Planner, Xbox",
    "image": "//media.hungbok.net/image/news/hb_free-play-days-railway-empire-prison-architect-and-tramsim-console-edition_1714131116739.jpg",
    "date": "2024-04-26",
    "published": "2024-04-26-20-31-57",
    "en": {
      "lang": "en",
      "title": "Free Play Days – Railway Empire, Prison Architect and TramSim: Console Edition",
      "summary": "Embark on a thrilling journey with Free Play Days, featuring the strategic depths of Railway Empire, the intricate challenges of Prison Architect, and the immersive urban experience of TramSim: Console Edition!",
      "content": "<div>Embark on a thrilling journey with Free Play Days, featuring the strategic depths of <p class=\"bold\">Railway Empire</p>, the intricate challenges of <p class=\"bold\">Prison Architect</p>, and the immersive urban experience of <p class=\"bold\">TramSim: Console Edition</p>! All are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from <p class=\"bold\">Thursday April 25 at 12:01 a.m. PDT</p> until <p class=\"bold\">Sunday, April 28 at 11:59 p.m. PDT</p>.</div><div></div><div>Game Pass Core will give players access to our advanced multiplayer network, a select collection of over 25 games to play with friends around the world, and exclusive member deals! Read more about <a href=\"https://news.xbox.com/en-us/2023/09/13/game-pass-core-full-list\">Game Pass Core at Xbox Wire</a>.</div><div></div><div><p class=\"h1\">How To Start Playing</p></div><div>Find and install the games on each of the individual game details page on Xbox.com. Clicking through will send you to the Microsoft Store, where you must be signed in to see the option to install with your Xbox Game Pass Core or Xbox Game Pass Ultimate membership. To download on console, click on the Subscriptions tab in the Xbox Store and navigate down to the Free Play Days collection on your Xbox One and Xbox Series X|S.</div><div></div><div><p class=\"h1\">Keep The Fun Going</p></div><div>Purchase the game and other editions at a limited time discount and continue playing while keeping your Gamerscore and achievements earned during the event! Please note that discounts, percentages, and title availability may vary by title and region.</div><div></div><div><p class=\"h1\">Free Play Days (Game Pass Core or Game Pass Ultimate Required)</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130838321.jpg\" title=\"Railway Empire\"></div></div><div></div><div><p class=\"bold\">Railway Empire</p> </div><div>Your model train set just got a lot bigger! Fire up your favorite historically accurate locomotive and play your way through an extensive campaign in the Golden Age of industry in Railway Empire. Establish a wide-ranging train network connecting far-flung rural villages to bustling cityscapes in one of the 40 detailed locomotives modelled in extraordinary detail. Tap into the economic opportunities of the early United States railway system to become a powerful industrialist by optimizing the transportation of passengers and goods.  But, whilst you may have the intellect to climb to the top, do you have the cunning to stay there? Pitted against up to three rival railway magnates intent on expanding their spheres of influence. Will you create a trade and transport empire to stand the test of time, or will you be another footnote left by the wayside? Lay your tracks and begin your saga today with Railway Empire now on Free Play Days. </div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130859121.jpg\" title=\"Prison Architect: Xbox One Edition\"></div></div><div></div><div><p class=\"bold\">Prison Architect</p> </div><div>Only the world’s most ruthless Warden can contain the world’s most ruthless inmates. Design and develop your personalized penitentiary in Prison Architect. In Prison Architect, you will see the impact of your grand design on the lives of your inmates; be it a utopic center for rehabilitation, a brutal Super Max Prison or anything in between. Even when all of your prisoners’ needs are met, remember one thing – it’s still a prison and no one really wants to be there.</div><div></div><div><p class=\"h1\">Free Play Days For All</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130876276.jpg\" title=\"TramSim: Console Edition\"></div></div><div></div><div><p class=\"bold\">TramSim: Console Edition</p></div><div>Urban transport comes to life in TramSim: Console Edition! Enjoy the most realistic tram driving experience ever made, with photorealistic graphics, true-to-life physics, and authentic tram controls. Carry out scenarios across the faithfully reproduced tramways of Munich and Vienna and take in the sites of these historic cities from the cab of your tram. Run to the timetable and face unique challenges across two lines aboard the Flexity and retro Type E2 trams in Vienna. Transport passengers with the unique R2.2b tram through Munich, rich with historic structures spread throughout 3 lines. Both cities are populated with dynamic road traffic and pedestrian behavior. Anyone can join in the fun! Start with beginner mode, learn in the tutorials, and master the art of tram driving, the passengers of Vienna and Munich await in TramSim: Console Edition!</div><div></div><div>Don’t miss out on these exciting Free Play Days for Xbox Game Pass Core and Xbox Game Pass Ultimate members! <a href=\"https://support.xbox.com/en-US/help/subscriptions-billing/buy-games-apps/free-play-days-faq\">Learn more about Free Play Days here</a> and stay tuned to Xbox Wire to find out about future Free Play Days and all the latest Xbox gaming news. </div>",
      "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    },
    "copyright": "© 2021-2024 HungBok. All Rights Reserved.",
    "ja": {
      "lang": "ja",
      "title": "Free Play Days – 『Railway Empire』、『プリズン・アーキテクト』、『TramSim: Console Edition』",
      "summary": "『Railway Empire』における戦略的な奥深さ、『プリズン・アーキテクト』の複雑なチャレンジ、『TramSim: Console Edition』ならではの没入感ある都市体験など、Free Play Days で様々なシミュレーションを味わってみましょう。",
      "content": "<div>『<p class=\"bold\">Railway Empire</p>』における戦略的な奥深さ、『<p class=\"bold\">プリズン・アーキテクト</p>』の複雑なチャレンジ、『<p class=\"bold\">TramSim: Console Edition</p>』ならではの没入感ある都市体験など、Free Play Days で様々なシミュレーションを味わってみましょう。</div><div></div><div>今週末の「Free Play Days」では、『Railway Empire』、『プリズン・アーキテクト：Xbox One エディション』、『TramSim: Console Edition』が Xbox Game Pass Core と Xbox Game Pass Ultimate メンバーを対象に、<p class=\"bold\">4 月 25 日 (木) 午後 4 時 1 分</p>から <p class=\"bold\">4 月 29 日 (月) 午後 3 時 59 分</p>までプレイできます。</div><div></div><div>Xbox Game Pass Core では、高度なマルチプレイヤー ネットワーク、世界中のフレンドとプレイできる厳選されたゲーム コレクション、および会員限定のお得なサービスをご利用いただけます! Xbox Game Pass Core についての詳細は、<a href=\"https://news.xbox.com/ja-jp/2023/09/14/game-pass-core-full-list\">Xbox Wire Japan の記事</a>をご覧ください。</div><div></div><div><p class=\"h1\">遊び始めるには</p></div><div>Free Play Days タイトルを遊び始めるには、以下のゲーム リストからそれぞれのタイトルの詳細を Xbox.com で確認し、Microsoft Store にサインインして、Xbox Game Pass Core、もしくは Xbox Game Pass Ultimate メンバーとして認証してください。</div><div></div><div>Xbox 本体へとダウンロードする場合、Xbox Store のサブスクリプション タブに移動し、Free Play Days コレクションより遊びたいゲームを選択し Xbox One あるいは Xbox Series X|S にダウンロードしてください。</div><div></div><div><p class=\"h1\">引き続き遊びたい場合</p></div><div>「Free Play Days」終了後も実績を維持し、ゲームを遊び続けたい場合、各タイトルを割引価格にてご購入いただけます。</div><div></div><div>割引の実施、割引率、そしてプレイ出来るタイトルは国または地域ごとに変更となる場合があります。</div><div></div><div><p class=\"h1\">Free Play Days 対象タイトル</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130838321.jpg\" title=\"Railway Empire\"></div></div><div></div><div><p class=\"bold\">Railway Empire</p> </div><div>『Railway Empire』の舞台は、1830年代から約100年にわたる開拓時代のアメリカとなります。プレイヤーは鉄道会社の社長となり、都市間に線路を敷いて交通網を作っていきます。緻密にモデリングされた 40 種類以上の機関車を使って、遠く離れた農村から賑やかな都市を結ぶ広範な鉄道網を築き上げていきます。無料プレイで今すぐ『Railway Empire』を起動することで、鉄道王の伝説が始まります!</div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130859121.jpg\" title=\"Prison Architect: Xbox One Edition\"></div></div><div></div><div><p class=\"bold\">プリズン・アーキテクト：Xbox One エディション</p> </div><div>世界で最も冷酷な囚人を収容できるのは、世界で最も冷酷な看守だけ。『プリズン・アーキテクト』で、あなただけの刑務所を設計・開発しましょう。社会秩序とかけ離れたその場所で、囚人たちの命運を握るのはあなたです。</div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714130876276.jpg\" title=\"TramSim: Console Edition\"></div></div><div></div><div><p class=\"bold\">TramSim: Console Edition</p></div><div>『TramSim: Console Edition』で都市交通に命を吹き込んでみましょう！　リアルなグラフィックや物理演算によって、これまでにないリアルな路面電車の運転体験をお楽しみいただけます。たとえば、ミュンヘンやウィーンの路面電車を忠実に再現したシナリオを選べば、トラムの運転席から歴史的名所を巡ることができるでしょう。ビギナーモードから始めて、チュートリアルで基本運転操作を学んだら、キャンペーンをじっくり遊んでみてください。</div><div></div><div><p class=\"h1\">Free Play Days について</p></div><div></div><div>Xbox Game Pass Core、または Xbox Game Pass Ultimate でお楽しみいただける「Free Play Days」の詳細については<a href=\"https://support.xbox.com/ja-JP/help/subscriptions-billing/buy-games-apps/free-play-days-faq\">こちら</a>からご確認ください。</div><div></div><div>Xbox Wire Japan では今後も「Free Play Days」や Xbox に関連したニュースをお届けする予定です。</div><div></div><div></div><div></div><div>※この記事は米国時間 4 月 25 日 に公開された“Free Play Days – Railway Empire, Prison Architect and TramSim: Console Edition”を基にしています。</div>",
      "published": "2024-04-26-20-59-38",
      "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
  }
]