[
    {
        "type": "games",
        "url": "2024-05-17-the-epic-mega-sale-2024-starts-now",
        "link": "QAcAh28P",
        "writer": "Epic Games",
        "image": "//media.hungbok.net/image/news/hb_the-epic-mega-sale-2024-starts-now_1715873374314.jpg",
        "date": "2024-05-17",
        "published": "2024-05-17-00-29-35",
        "en": {
            "lang": "en",
            "title": "The Epic MEGA Sale 2024 starts now!",
            "summary": "Four weeks of amazing discounts, free games, and great giveaways on the Epic Games Store kicks off today! From May 16, 11 AM ET (4 PM BST / 5PM CST) until June 13, 11 AM ET (4 PM BST / 5PM CST), get discounts on classic games with gods to battle, mysteries to unravel, a pirate legacy to build, and so much more.",
            "content": "<div>Welcome to the <a href=\"https://store.epicgames.com/sales-and-specials/mega-sale\">Epic MEGA Sale 2024</a>!</div><div></div><div>Four weeks of amazing discounts, free games, and great giveaways on the Epic Games Store kicks off today! From <p class=\"bold\">May 16, 11 AM ET (4 PM BST / 5PM CST)</p> until <p class=\"bold\">June 13, 11 AM ET (4 PM BST / 5PM CST)</p>, get discounts on classic games with gods to battle, mysteries to unravel, a pirate legacy to build, and so much more.</div><div></div><div>Along with the deals, we’ll be releasing an iconic free game from the Vault every week during the sale, as well as giveaways for some of the biggest titles in our store. And you earn Epic Rewards on eligible purchases!</div><div></div><div><p class=\"bold\">What is the Epic MEGA Sale?</p></div><div>It’s an enormous range of discounts across the Epic Games Store’s library. Grab a classic indie or hidden gem, snag a reboot or remake, and fill your library with great games.</div><div></div><div><p class=\"bold\">What free PC games are in the Vault?</p></div><div>We’re giving away some incredible free games every week for the duration of the sale, with the first making its debut <a href=\"https://store.epicgames.com/news/epic-mega-sale-2024-first-free-weekly-game-is-here\">on the Store</a> right now. But be warned, there be Dragons…</div><div></div><div><p class=\"bold\">What are the Epic MEGA Sale giveaways?</p></div><div>We love giving you stuff. This year, you can pick up free cosmetics and more across our awesome titles and apps. Take a peek at the whole haul in the <a href=\"https://store.epicgames.com/news/epic-mega-sale-giveaways-2024\">dedicated blog</a>, which you can find <a href=\"https://store.epicgames.com/news\">here</a>.</div><div></div><div><p class=\"bold\">Don’t forget to use your Epic Rewards during the sale!</p></div><div><a href=\"https://store.epicgames.com/features/epic-rewards\">Epic Rewards</a> is a program where you earn rewards for each of your purchases. You get 5% back on all store purchases granted to your rewards balance. You can use the rewards you collected so far to purchase games, DLCs, and more, whenever you want, including during Epic MEGA Sale. Find your <a href=\"https://www.epicgames.com/account/rewards\">current rewards balance here</a>. (You need to be signed in.)</div><div></div><div>Not sure what to choose? Find out below. From indies to AAA, the Epic Games Store News page has you covered.</div><div> </div><div></div><div><p class=\"h1\">Epic MEGA Sale Highlights</p></div><div></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/news/hb_the-epic-games-mega-sale-starts-now-alan-wake-2.jpg</div><div>\" title=\"The Epic MEGA Sale 2024 starts now! Alan Wake 2\"></div></div><div></div><div><p class=\"bold\"><a href=\"https://store.epicgames.com/p/alan-wake-2\">Alan Wake 2</a></p></div><div>Remedy’s brilliant new chapter in Alan Wake’s story is a survival horror game spanning multiple realities. The author has been trapped in a world of his own creation for over a decade, battling to write his way out of the Dark Place. In the real world, FBI Special Agent Saga Anderson is probing the strange goings-on in Bright Falls. You’ll need to take control of both characters in the fight against darkness. And yup, we have <a href=\"https://store.epicgames.com/news/alan-wake-2-guide-to-surviving-the-horrors-within\">a guide</a> for that, too!</div><div></div><div><p class=\"bold\"><a href=\"https://store.epicgames.com/p/expeditions-a-mudrunner-game-e6bda2\">Expeditions: A MudRunner Game</a></p></div><div>Getting stuck in the mud has never been so much fun. Expeditions: A MudRunner Game is about research and discovery in tricky terrain. It’s a sticky test of your planning and problem solving skills—and your driving. Every trip is a slog against the elements, where you scout a route, grind gears, and push your vehicle to the breaking point. You will get stuck, but it’s how you deal with it that matters. We’ve put together <a href=\"https://store.epicgames.com/news/stay-out-of-trouble-with-our-expeditions-a-mudrunner-game-beginner-s-guide\">a guide</a> to help you get moving again.</div><div></div><div><p class=\"bold\"><a href=\"https://store.epicgames.com/p/skull-and-bones\">Skull and Bones</a></p></div><div>This action-adventure game on the high seas pits you against other captains in East Africa and Southeast Asia during the golden age of pirates. From a single Dhow with torn sails, build your fleet and your legend as a fearsome freebooter in Ubisoft’s seafaring adventure game. If you get into deep water, our <a href=\"https://store.epicgames.com/news/skull-and-bones-beginner-s-guide-14-tips-to-rule-the-seas-as-a-pirate-lord\">beginner’s guide</a> will help you out.</div><div></div><div><p class=\"bold\"><a href=\"https://store.epicgames.com/p/dead-island-2\">Dead Island 2</a></p></div><div>The most anatomical action game of all time, Dead Island 2’s body physics means your first-person battle against the hordes of Infected is full of lopped-off limbs and icky innards. Take advantage of clever environmental elements and upgrade your weapons with awesome powers, as you embark on a gruesome and exciting adventure <a href=\"https://store.epicgames.com/news/six-top-tips-you-should-know-before-diving-into-dead-island-2\">through HELL-A</a>.</div><div></div><div><p class=\"bold\"><a href=\"https://store.epicgames.com/p/prince-of-persia-the-lost-crown\">Prince of Persia The Lost Crown</a></p></div><div>Prince of Persia The Lost Crown harkens back to the series’ platforming roots and makes a royal return to form. It’s a truly stunning adventure through a mythology-infused Mount Qaf. Sargon slices, leaps, and controls time itself across the Persian-inspired landscape, fighting swathes of enemies and solving tricky puzzles. Grab it—and if you get stuck, consult <a href=\"https://store.epicgames.com/news/prince-of-persia-the-lost-crown-guide-12-exploration-and-survival-tips\">our top tips</a>.  </div><div></div><div>It’s time, the <a href=\"https://store.epicgames.com/sales-and-specials/mega-sale\">Epic MEGA Sale</a> is now live! Keep an eye on the <a href=\"https://store.epicgames.com/news\">Epic Games Store News</a> page for more updates throughout the sale.</div>",
            "copyright": "© 2021-2024 HungBok. All Rights Reserved."
        },
        "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
]