[
    {
        "type": "games",
        "url": "2024-05-24-free-play-days-warhammer-takeover",
        "link": "GwiEK5CA",
        "writer": "Xbox",
        "image": "//media.hungbok.net/image/news/hb_free-play-days-warhammer-takeover_1716556644890.jpg",
        "date": "2024-05-24",
        "published": "2024-05-24-22-17-26",
        "en": {
            "lang": "en",
            "title": "Free Play Days – Warhammer Takeover",
            "summary": "Get ready to march into the realm of strategy and conquest with the Warhammer Takeover event during Free Play Days!",
            "content": "<div>Get ready to march into the realm of strategy and conquest with the Warhammer Takeover event during Free Play Days! For a limited time, immerse yourself in the epic universe of Warhammer with 9 thrilling titles. Whether you’re commanding the mighty armies of the Imperium in <p class=\"bold\">Warhammer 40,000: Mechanicus</p>, navigating the treacherous politics of <p class=\"bold\">Warhammer 40,000: Rogue Trader</p>, or battling through the realms of chaos in <p class=\"bold\">Warhammer Age of Sigmar: Realms of Ruin</p>, there’s a world of adventure waiting for every type of warrior.</div><div></div><div><p class=\"bold\">Necromunda Underhive Wars</p>, <p class=\"bold\">Warhammer Vermintide 2</p>, <p class=\"bold\">Warhammer 40,000 Mechanicus</p>, <p class=\"bold\">Blood Bowl 3</p>, <p class=\"bold\">Warhammer 40,000 Inquisitor – Martyr Ultimate Edition</p>, <p class=\"bold\">Warhammer Chaosbane Xbox One</p>, <p class=\"bold\">Talisman Digital Edition</p>, <p class=\"bold\">Warhammer 40,000 Rogue Trader</p>, and <p class=\"bold\">Warhammer Age of Sigmar Realms of Ruin</p> are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from <p class=\"bold\">Thursday May 23 at 12:01 a.m. PDT</p> until <p class=\"bold\">Sunday, May 26 at 11:59 p.m. PDT</p>.</div><div></div><div>Game Pass Core will give players access to our advanced multiplayer network, a select collection of over 25 games to play with friends around the world, and exclusive member deals! Read more about <a href=\"https://news.xbox.com/en-us/2023/09/13/game-pass-core-full-list/\">Game Pass Core at Xbox Wire</a>. </div><div></div><div><p class=\"h1\">How To Start Playing</p></div><div></div><div>Find and install the games on each of the individual game details page on Xbox.com. Clicking through will send you to the Microsoft Store, where you must be signed in to see the option to install with your Xbox Game Pass Core or Xbox Game Pass Ultimate membership. To download on console, click on the Subscriptions tab in the Xbox Store and navigate down to the Free Play Days collection on your Xbox One and Xbox Series X|S.</div><div></div><div><p class=\"h1\">Keep The Fun Going</p></div><div></div><div>Purchase the game and other editions at a limited time discount and continue playing while keeping your Gamerscore and achievements earned during the event! <p class=\"bold\">Please note that discounts, percentages, and title availability may vary by title and region.</p></div><div></div><div><p class=\"h1\">Free Play Days (Game Pass Core or Game Pass Ultimate Required)</p></div><div></div><div><p class=\"bold\">Necromunda: Underhive Wars</p></div><div>Deep below the hive cities of Necromunda, lead, customize and grow your gang in the twisted tunnels of the dystopian Underhive. Face rival gangs in tactical gunfights for power, wealth, survival, and honor.</div><div></div><div><p class=\"bold\">Warhammer: Vermintide 2</p></div><div>Warhammer: Vermintide 2 is the sequel to the critically acclaimed Warhammer: End Times – Vermintide. Fight together with your friends against the forces of Chaos and Skaven in this epic 4-player co-op game set in the Warhammer Fantasy Battles world. Vermintide 2 expands the intense first-person combat with a brand-new enemy faction, 15 new career paths, talent trees, new weapons, an improved loot system, and more.</div><div></div><div><p class=\"bold\">Warhammer 40,000: Mechanicus</p></div><div>Take control of the most technologically advanced army in the Imperium – The Adeptus Mechanicus. Your every decision will weigh heavily on the outcome of the mission, in this turn-based tactical game. Will you be blessed by the Omnissiah?</div><div></div><div><p class=\"bold\">Blood Bowl 3</p></div><div>Brutal, crazy, tactical… this is BLOOD BOWL! The iconic death sport returns with the new video game of fantasy football faithfully using the latest board game rules and new content. Crush your way to the top and leave your opponents in the graveyard!</div><div></div><div><p class=\"bold\">Warhammer 40,000: Inquisitor – Martyr Ultimate Edition</p></div><div>The Ultimate Edition includes Warhammer 40,000: Inquisitor – Martyr and all additional content. You are an Inquisitor, the Imperium’s most powerful agent. In this action-RPG, choose from amongst several character classes and take part in tactical and violent combat, in solo or co-op mode.</div><div></div><div><p class=\"bold\">Warhammer: Chaosbane Xbox One</p></div><div>In a world ravaged by war and dominated by magic, you are the last hope for the Empire of Man against the Chaos hordes. Playing solo or with up to four players in local or online co-op, choose a hero from four character classes with unique and complementary skills, and prepare for epic battles wielding some of the most powerful artefacts of the Old World.</div><div></div><div><p class=\"bold\">Talisman: Digital Edition</p></div><div>The officially licensed multiplayer version of the classic fantasy adventure board game, Talisman. On your travels, you will need strength, courage and some good dice rolls to survive the dangers you face and beat your opponents to the centre of the board!</div><div></div><div><p class=\"bold\">Warhammer 40,000: Rogue Trader</p></div><div>Made in a close partnership with Games Workshop, Warhammer 40,000: Rogue Trader is a story-rich classical RPG from Owlcat Games. Begin your adventure aboard your personal, giant voidship, traveling between the multitude of systems within the Koronus Expanse, a barely charted and incredibly perilous region of space.</div><div></div><div><p class=\"bold\">Warhammer Age of Sigmar: Realms of Ruin</p></div><div>Wage a campaign of brutal conquest in this realm-shattering real-time strategy game set in the Warhammer Age of Sigmar universe. Command four unique factions in dynamic battles as part of a story-driven campaign and test your mettle against warlords afar in online multiplayer.</div><div></div><div>Don’t miss out on these exciting Free Play Days for Xbox Game Pass Core and Xbox Game Pass Ultimate members! <a href=\"https://support.xbox.com/en-US/help/subscriptions-billing/buy-games-apps/free-play-days-faq\">Learn more about Free Play Days here</a> and stay tuned to Xbox Wire to find out about future Free Play Days and all the latest Xbox gaming news. </div>",
            "copyright": "© 2021-2024 HungBok. All Rights Reserved."
        },
        "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
]