[
    {
        "type": "games",
        "url": "2024-05-17-free-play-days-killing-floor-2-and-planet-coaster-console-edition",
        "link": "TmuwzV1E",
        "writer": "Xbox",
        "image": "//media.hungbok.net/image/news/hb_free-play-days-killing-floor-2-and-planet-coaster-console-edition_1715933217647.jpg",
        "date": "2024-05-17",
        "published": "2024-05-17-17-06-58",
        "en": {
            "lang": "en",
            "title": "Free Play Days – Killing Floor 2 and Planet Coaster: Console Edition",
            "summary": "Experience intense combat and imaginative world building this weekend with Free Play Days! Killing Floor 2 and Planet Coaster: Console Edition are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from Thursday May 16 at 12:01 a.m. PDT until Sunday, May 19 at 11:59 p.m. PDT.",
            "content": "<div>Experience intense combat and imaginative world building this weekend with Free Play Days! <p class=\"bold\">Killing Floor 2</p> and <p class=\"bold\">Planet Coaster: Console Edition</p> are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from <p class=\"bold\">Thursday May 16 at 12:01 a.m. PDT</p> until <p class=\"bold\">Sunday, May 19 at 11:59 p.m. PDT</p>.  </div><div></div><div>Game Pass Core will give players access to our advanced multiplayer network, a select collection of over 25 games to play with friends around the world, and exclusive member deals! Read more about <a href=\"https://news.xbox.com/en-us/2023/09/13/game-pass-core-full-list/\">Game Pass Core at Xbox Wire</a>. </div><div></div><div><p class=\"h1\">How To Start Playing</p></div><div></div><div>Find and install the games on each of the individual game details page on Xbox.com. Clicking through will send you to the Microsoft Store, where you must be signed in to see the option to install with your Xbox Game Pass Core or Xbox Game Pass Ultimate membership. To download on console, click on the Subscriptions tab in the Xbox Store and navigate down to the Free Play Days collection on your Xbox One and Xbox Series X|S.</div><div></div><div><p class=\"h1\">Keep The Fun Going</p></div><div></div><div>Purchase the game and other editions at a limited time discount and continue playing while keeping your Gamerscore and achievements earned during the event! <p class=\"bold\">Please note that discounts, percentages, and title availability may vary by title and region</p>.</div><div></div><div><p class=\"h1\">Free Play Days (Game Pass Core or Game Pass Ultimate Required)</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715933053953.jpg\" title=\"Killing Floor 2\"></div></div><div></div><div><p class=\"bold\">Killing Floor 2</p></div><div>In Killing Floor 2, players descend into continental Europe after it has been overrun by horrific, murderous clones called Zeds that were created by rogue elements of the Horzine Corporation. Civilization is in disarray, governments have collapsed, and military forces have been systematically eradicated. But not all have given up hope; a motley group of civilians, soldiers, and mercenaries have banded together to fight the Zed outbreaks. Welcome to the Killing Floor. </div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715933074495.jpg\" title=\"Planet Coaster: Console Edition\"></div></div><div></div><div><p class=\"bold\">Planet Coaster: Console Edition</p></div><div>Surprise, delight and thrill crowds as you create the theme park of your dreams! Build and design incredible coaster parks in Planet Coaster with unparalleled attention to detail and manage your park in a truly living world. Bring your ideas to life with easy-to-use tools, manage all aspects of your expanding empire, and harness the world’s best creations from an endlessly creative community in the Frontier Workshop. Enjoy up to 75% off discount during Free Play Days. </div><div></div><div>Don’t miss out on these exciting Free Play Days for Xbox Game Pass Core and Xbox Game Pass Ultimate members! <a href='https://support.xbox.com/en-us/help/subscriptions-billing/buy-games-apps/free-play-days-faq'>Learn more about Free Play Days</a> here and stay tuned to Xbox Wire to find out about future Free Play Days and all the latest Xbox gaming news. </div>",
            "copyright": "© 2021-2024 HungBok. All Rights Reserved."
        },
        "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
]
