[
    {
        "type": "games",
        "url": "2024-05-03-free-play-days-star-wars-jedi-survivor-and-headbangers-rhythm-royale",
        "link": "JWeDQgEB",
        "writer": "Xbox",
        "image": "//media.hungbok.net/image/news/hb_free-play-days-star-wars-jedi-survivor-and-headbangers-rhythm-royale_1714670208097.jpg",
        "date": "2024-05-03",
        "published": "2024-05-03-02-16-49",
        "en": {
            "lang": "en",
            "title": "Free Play Days – Star Wars Jedi: Survivor and Headbangers: Rhythm Royale",
            "summary": "Let’s kick off May the right way with Free Play Days! Headbangers: Rhythm Royale is available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from Thursday May 2 at 12:01 a.m. PDT until Sunday, May 5 at 11:59 p.m. PDT.",
            "content": "<div>Let’s kick off May the right way with Free Play Days! <p class=\"bold\">Headbangers: Rhythm Royale</p> is available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from <p class=\"bold\">Thursday May 2 at 12:01 a.m. PDT</p> until <p class=\"bold\">Sunday, May 5 at 11:59 p.m. PDT</p>.</div><div></div><div>Additionally, <p class=\"bold\">Star Wars: Survivor</p> is free to try for <p class=\"bold\">all Xbox members</p> during the same time (Xbox Game Pass Core and Xbox Game Pass Ultimate not required) with a <p class=\"bold\">5 hour gameplay trial</p>.  </div><div></div><div>Game Pass Core will give players access to our advanced multiplayer network, a select collection of over 25 games to play with friends around the world, and exclusive member deals! Read more about <a href=\"https://news.xbox.com/en-us/2023/09/13/game-pass-core-full-list\">Game Pass Core at Xbox Wire</a>. </div><div></div><div><p class=\"h1\">How To Start Playing</p></div><div>Find and install the games on each of the individual game details page on Xbox.com. Clicking through will send you to the Microsoft Store, where you must be signed in to see the option to install with your Xbox Game Pass Core or Xbox Game Pass Ultimate membership. To download on console, click on the Subscriptions tab in the Xbox Store and navigate down to the Free Play Days collection on your Xbox One and Xbox Series X|S.</div><div></div><div><p class=\"h1\">Keep The Fun Going</p></div><div>Purchase the game and other editions at a limited time discount and continue playing while keeping your Gamerscore and achievements earned during the event! <p class=\"bold\">Please note that discounts, percentages, and title availability may vary by title and region</p>.</div><div></div><div><p class=\"h1\">Free Play Days For All</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714669671444.jpg\" title=\"Star Wars Jedi: Survivor\"></div></div><div></div><div><p class=\"bold\">Star Wars Jedi: Survivor</p> </div><div>The story of Cal Kestis continues in Star Wars Jedi: Survivor™, a third person galaxy-spanning action-adventure game from Respawn Entertainment, developed in collaboration with Lucasfilm Games. This narratively driven, single player title picks up five years after the events of Star Wars Jedi: Fallen Order™ and follows Cal’s increasingly desperate fight as the galaxy descends further into darkness. </div><div></div><div><p class=\"h1\">Free Play Days (Game Pass Core or Game Pass Ultimate Required)</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1714669711386.jpg\" title=\"Headbangers: Rhythm Royale\"></div></div><div></div><div><p class=\"bold\">Headbangers: Rhythm Royale</p></div><div>Ever wanted to be a dancing pigeon? Well, this is your chance. Headbangers: Rhythm Royale will see you and 29 other pigeons battle it out to find out who is the ultimate Master Headbanger. With Season 3 the game has been expanded to include a 1v1 mode alongside classic Royale gameplay. Take on a rival pigeon in a dance-off with a difference. Hit the beat, show off your moves, and utilize various powerups to get an edge over your feathered opponent. Songs get progressively more challenging, until finally, one pigeon fails and the survivor reigns victoriously. </div><div></div><div>Don’t miss out on these exciting Free Play Days for Xbox Game Pass Core and Xbox Game Pass Ultimate members! <a href=\"https://support.xbox.com/en-US/help/subscriptions-billing/buy-games-apps/free-play-days-faq\">Learn more about Free Play Days here</a> and stay tuned to Xbox Wire to find out about future Free Play Days and all the latest Xbox gaming news. </div>",
            "copyright": "© 2021-2024 HungBok. All Rights Reserved."
        },
        "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
]