[
    {
        "type": "games",
        "url": "2024-05-10-free-play-days-destiny-2-expansions-crime-boss-rockay-city-cities-skylines-remastered-and-from-space",
        "link": "uH6TbLbk",
        "writer": "Xbox",
        "image": "//media.hungbok.net/image/news/hb_free-play-days-destiny-2-expansions-crime-boss-rockay-city-cities-skylines-remastered-and-from-space_1715337698277.jpg",
        "date": "2024-05-10",
        "published": "2024-05-10-19-41-39",
        "en": {
            "lang": "en",
            "title": "Free Play Days – Destiny 2 Expansions, Crime Boss: Rockay City, Cities: Skylines – Remastered and From Space",
            "summary": "We’ve got a jam-packed weekend for you with Free Play Days! Crime Boss: Rockay City, Cities Skylines – Remastered and From Space are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from Thursday May 9 at 12:01 a.m. PDT until Sunday, May 12 at 11:59 p.m. PDT. ",
            "content": "<div>We’ve got a jam-packed weekend for you with Free Play Days! <p class=\"bold\">Crime Boss: Rockay City</p>, <p class=\"bold\">Cities Skylines – Remastered</p> and <p class=\"bold\">From Space</p> are available this weekend for Xbox Game Pass Core and Xbox Game Pass Ultimate members to play from <p class=\"bold\">Thursday May 9 at 12:01 a.m. PDT</p> until <p class=\"bold\">Sunday, May 12 at 11:59 p.m. PDT</p>. </div><div></div><div>Additionally, expansions for <p class=\"bold\">Destiny 2</p> including <p class=\"bold\">Shadowkeep</p>, <p class=\"bold\">Beyond Light</p> and <p class=\"bold\">The Witch Queen</p> are free for <p class=\"bold\">all Xbox members</p> from May 7 until June 4 (Xbox Game Pass Core and Xbox Game Pass Ultimate not required). </div><div></div><div>Game Pass Core will give players access to our advanced multiplayer network, a select collection of over 25 games to play with friends around the world, and exclusive member deals! Read more about <a href=\"https://news.xbox.com/en-us/2023/09/13/game-pass-core-full-list/\">Game Pass Core at Xbox Wire</a>. </div><div></div><div><p class=\"h1\">How To Start Playing</p></div><div></div><div>Find and install the games on each of the individual game details page on Xbox.com. Clicking through will send you to the Microsoft Store, where you must be signed in to see the option to install with your Xbox Game Pass Core or Xbox Game Pass Ultimate membership. To download on console, click on the Subscriptions tab in the Xbox Store and navigate down to the Free Play Days collection on your Xbox One and Xbox Series X|S.</div><div></div><div><p class=\"h1\">Keep The Fun Going</p></div><div></div><div>Purchase the game and other editions at a limited time discount and continue playing while keeping your Gamerscore and achievements earned during the event! <p class=\"bold\">Please note that discounts, percentages, and title availability may vary by title and region.</p></div><div></div><div><p class=\"h1\">Free Play Days (Game Pass Core or Game Pass Ultimate Required)</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715336973028.jpg\" title=\"Crime Boss: Rockay City\"></div></div><div></div><div><p class=\"bold\">Crime Boss: Rockay City</p></div><div></div><div>Play Crime Boss: Rockay City for FREE! This co-operative, organized heisting game can be played either solo in the single-player campaign or with friends in multiplayer. Start levelling up and earning rewards in the new progression system and enjoy tons of new content from our latest update. </div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715336988502.jpg\" title=\"Cities: Skylines - Remastered\"></div></div><div></div><div><p class=\"bold\">Cities: Skylines – Remastered</p></div><div></div><div>Cities: Skylines – Remastered puts you in charge of a growing city, from the ground-breaking of its first streets to the ever-changing needs of thousands of citizens. Design, build, and manage the city of your dreams, from public services to civic policies, and challenge yourself to grow from a simple town to a bustling metropolitan hub.</div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715337003165.jpg\" title=\"From Space\"></div></div><div></div><div><p class=\"bold\">From Space</p></div><div></div><div>From Space is a solo and co-op action-shooter for squads up to four players. Take on the challenge of liberating the earth from an alien infestation with your friends, using over-the-top weaponry in a post-apocalyptic world with awesomely stylized graphics. The apocalypse has never been so much fun! </div><div></div><div><p class=\"h1\">Free Play Days For All</p></div><div></div><div><div class=\"image-container\"><img src=\"https://media.hungbok.net/image/free-games/hb_1715337028854.jpg\" title=\"Destiny 2: Legacy Collection\"></div></div><div></div><div><p class=\"bold\">Destiny 2 Expansions (Shadowkeep, Beyond Light, The Witch Queen)</p></div><div></div><div>During Destiny 2’s Expansion Open Access month, you can play through Shadowkeep, Beyond Light, and The Witch Queen, along with all four Year-6 Seasons. Enjoy the updated New Light experience by exploring the Cosmodrome or skip it and join your friends right away. Open Access Month ends when The Final Shape launches, but any rewards you collect are yours to keep. </div><div></div><div>Don’t miss out on these exciting Free Play Days for Xbox Game Pass Core and Xbox Game Pass Ultimate members! <a href=\"https://support.xbox.com/en-US/help/subscriptions-billing/buy-games-apps/free-play-days-faq\">Learn more about Free Play Days here</a> and stay tuned to Xbox Wire to find out about future Free Play Days and all the latest Xbox gaming news. </div>",
            "copyright": "© 2021-2024 HungBok. All Rights Reserved."
        },
        "copyright": "© 2021-2024 HungBok. All Rights Reserved."
    }
]